sglang_local_25rq_20G_nocompile.txt
Namespace(backend='sglang', base_url='https://sglang02.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=2048, random_output_len=128, random_range_ratio=1.0, request_rate=2.5, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.5
============ Serving Benchmark Result ============
Successful requests:                     17290     
Benchmark duration (s):                  8239.57   
Total input tokens:                      3749692   
Total generated tokens:                  3331148   
Request throughput (req/s):              2.10      
Input token throughput (tok/s):          455.08    
Output token throughput (tok/s):         404.29    
---------------Time to First Token----------------
Mean TTFT (ms):                          20629.64  
Median TTFT (ms):                        15827.94  
P99 TTFT (ms):                           49772.50  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          104.66    
Median TPOT (ms):                        103.73    
P99 TPOT (ms):                           159.10    
---------------Inter-token Latency----------------
Mean ITL (ms):                           105.00    
Median ITL (ms):                         98.21     
P99 ITL (ms):                            315.58    
==================================================