sglang_local_25rq_24G.txt
Namespace(backend='sglang', base_url='https://sglang03.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=2048, random_output_len=128, random_range_ratio=1.0, request_rate=2.5, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.5
============ Serving Benchmark Result ============
Successful requests:                     20472     
Benchmark duration (s):                  8192.79   
Total input tokens:                      4519759   
Total generated tokens:                  3972573   
Request throughput (req/s):              2.50      
Input token throughput (tok/s):          551.68    
Output token throughput (tok/s):         484.89    
---------------Time to First Token----------------
Mean TTFT (ms):                          282.92    
Median TTFT (ms):                        290.13    
P99 TTFT (ms):                           499.20    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          85.74     
Median TPOT (ms):                        84.06     
P99 TPOT (ms):                           140.93    
---------------Inter-token Latency----------------
Mean ITL (ms):                           85.02     
Median ITL (ms):                         87.47     
P99 ITL (ms):                            300.93    
==================================================